In [8]:
#Laura N ottaa gender, age
#Laura S ottaa family, years of service
#Aada ottaa education, salary



import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns


df = pd.read_csv("WorkPlaceSatisfactionSurveyData.xlsx - Data.csv")
df = df.drop(columns=["number","holidayCabin","gym", "muscleCare","healtcare"], errors="ignore")

In [10]:
df.head(11)

,gender,age,family,education,years_of_service,salary,sat_management,sat_colleques,sat_workingEnvironment,sat_salary,sat_tasks
0,1,38,1,1.0,22.0,3587,3,3.0,3,3,3
1,1,29,2,2.0,10.0,2963,1,5.0,2,1,3
2,1,30,1,1.0,7.0,1989,3,4.0,1,1,3
3,1,36,2,1.0,14.0,2144,3,3.0,3,3,3
4,1,24,1,2.0,4.0,2183,2,3.0,2,1,2
5,2,31,2,2.0,14.0,1910,4,4.0,5,2,4
6,1,49,1,2.0,16.0,2066,3,5.0,4,2,2
7,1,55,1,1.0,0.0,2066,3,5.0,3,1,3
8,1,40,2,1.0,23.0,2768,2,4.0,4,2,4
9,1,33,1,1.0,16.0,2106,3,2.0,1,1,1
10,1,39,2,1.0,22.0,2651,3,5.0,3,1,3

In [11]:
df.head()

,gender,age,family,education,years_of_service,salary,sat_management,sat_colleques,sat_workingEnvironment,sat_salary,sat_tasks
0,1,38,1,1.0,22.0,3587,3,3.0,3,3,3
1,1,29,2,2.0,10.0,2963,1,5.0,2,1,3
2,1,30,1,1.0,7.0,1989,3,4.0,1,1,3
3,1,36,2,1.0,14.0,2144,3,3.0,3,3,3
4,1,24,1,2.0,4.0,2183,2,3.0,2,1,2

In [13]:
df.isnull().sum()

gender                    0
age                       0
family                    0
education                 1
years_of_service          2
salary                    0
sat_management            0
sat_colleques             1
sat_workingEnvironment    0
sat_salary                0
sat_tasks                 0
dtype: int64

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 82 entries, 0 to 81
Data columns (total 11 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   gender                  82 non-null     int64
 1   age                     82 non-null     int64
 2   family                  82 non-null     int64
 3   education               81 non-null     float64
 4   years_of_service        80 non-null     float64
 5   salary                  82 non-null     int64
 6   sat_management          82 non-null     int64
 7   sat_colleques           81 non-null     float64
 8   sat_workingEnvironment  82 non-null     int64
 9   sat_salary              82 non-null     int64
 10  sat_tasks               82 non-null     int64
dtypes: float64(3), int64(8)
memory usage: 7.2 KB

In [16]:
df.drop(columns=['gender','family','education']).describe()

,age,years_of_service,salary,sat_management,sat_colleques,sat_workingEnvironment,sat_salary,sat_tasks
count,82.000000,80.000000,82.000000,82.000000,81.000000,82.000000,82.000000,82.000000
mean,37.951220,12.175000,2563.878049,3.060976,4.061728,3.219512,2.109756,3.195122
std,9.773866,8.807038,849.350302,1.058155,0.826826,1.154961,1.111179,1.047502
min,20.000000,0.000000,1521.000000,1.000000,2.000000,1.000000,1.000000,1.000000
25%,31.000000,3.750000,2027.000000,2.000000,4.000000,3.000000,1.000000,3.000000
50%,37.500000,12.500000,2320.000000,3.000000,4.000000,3.000000,2.000000,3.000000
75%,44.000000,18.250000,2808.000000,4.000000,5.000000,4.000000,3.000000,4.000000
max,61.000000,36.000000,6278.000000,5.000000,5.000000,5.000000,5.000000,5.000000

In [5]:
print("Ensimmäiset rivit:")
print(df.head())
print("\nInfo:")
print(df.info())

Ensimmäiset rivit:
   number  gender  age  family  education  years_of_service  salary  \
0       1       1   38       1        1.0              22.0    3587
1       2       1   29       2        2.0              10.0    2963
2       3       1   30       1        1.0               7.0    1989
3       4       1   36       2        1.0              14.0    2144
4       5       1   24       1        2.0               4.0    2183

   sat_management  sat_colleques  sat_workingEnvironment  sat_salary  \
0               3            3.0                       3           3
1               1            5.0                       2           1
2               3            4.0                       1           1
3               3            3.0                       3           3
4               2            3.0                       2           1

   sat_tasks  healtcare  holidayCabin  gym  muscleCare
0          3        NaN           NaN  NaN         NaN
1          3        NaN           NaN  NaN         NaN
2          3        1.0           NaN  NaN         NaN
3          3        1.0           NaN  NaN         NaN
4          2        1.0           NaN  NaN         NaN

Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 82 entries, 0 to 81
Data columns (total 16 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   number                  82 non-null     int64
 1   gender                  82 non-null     int64
 2   age                     82 non-null     int64
 3   family                  82 non-null     int64
 4   education               81 non-null     float64
 5   years_of_service        80 non-null     float64
 6   salary                  82 non-null     int64
 7   sat_management          82 non-null     int64
 8   sat_colleques           81 non-null     float64
 9   sat_workingEnvironment  82 non-null     int64
 10  sat_salary              82 non-null     int64
 11  sat_tasks               82 non-null     int64
 12  healtcare               47 non-null     float64
 13  holidayCabin            20 non-null     float64
 14  gym                     9 non-null      float64
 15  muscleCare              22 non-null     float64
dtypes: float64(7), int64(9)
memory usage: 10.4 KB
None

In [3]:
print("\nPuuttuvat arvot per muuttuja:")
print(df.isna().sum())

Puuttuvat arvot per muuttuja:
number                     0
gender                     0
age                        0
family                     0
education                  1
years_of_service           2
salary                     0
sat_management             0
sat_colleques              1
sat_workingEnvironment     0
sat_salary                 0
sat_tasks                  0
healtcare                 35
holidayCabin              62
gym                       73
muscleCare                60
dtype: int64